Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend.#ctor
Create a 180-degree bend constraint.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
A constraint which can be applied to a RebarShapeSegment, and causes the segment
to be replaced with a 180-degree arc. The arc's radius is not specified
by the shape; instead it is a "default bend radius," taken from
the RebarBarType associated with the Rebar instance.
Since:
2012